Config/Enums/СпособыПризнанияРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыПризнанияРасходов</Name>
			<Comment>Способы признания расходов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоМесяцам</Name>
					<Comment>Расходы признаются равномерно пропорционально количеству месяцев</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКалендарнымДням</Name>
					<Comment>Расходы признаются равномерно пропорционально количеству календарных дней</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоГрафику</Name>
					<Comment>Расходы признаются по графику финансирования</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаДатуПризнания</Name>
					<Comment>Доходы признаются на выбранную дату</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОсобомПорядке</Name>
					<Comment>Расходы признаются в особом порядке</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыОперацийНачисленияДБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийНачисленияДБП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередачаВАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВАрендуНаЛьготныхУсловиях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолгосрочныйДоговорОбразование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходыБудущихПериодов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыОперацийПринятияКУчетуПравПользованияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПринятияКУчетуПравПользованияОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеВАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеВАрендуНаЛьготныхУсловиях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеВБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/СпособыПризнанияРасходов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПараметрыВыбораСпособаПризнанияДоходов(ВидОперацииНачисленияДБП) Экспорт
	
	ДопустимыеСпособыПризнанияДоходов = Новый Массив;
	ДопустимыеСпособыПризнанияДоходов.Добавить(Перечисления.СпособыПризнанияРасходов.ПоМесяцам);
	ДопустимыеСпособыПризнанияДоходов.Добавить(Перечисления.СпособыПризнанияРасходов.ПоКалендарнымДням);
	Если ВидОперацииНачисленияДБП <> Перечисления.ВидыОперацийНачисленияДБП.ПередачаВБезвозмездноеПользование Тогда
		// При безвозмездном пользовании не может быть графика платежей.
		ДопустимыеСпособыПризнанияДоходов.Добавить(Перечисления.СпособыПризнанияРасходов.ПоГрафику);
	КонецЕсли;
	ДопустимыеСпособыПризнанияДоходов.Добавить(Перечисления.СпособыПризнанияРасходов.ВОсобомПорядке);
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка",
		Новый ФиксированныйМассив(ДопустимыеСпособыПризнанияДоходов));
	ПараметрыВыбораСпособаПризнанияДоходов = Новый Массив();
	ПараметрыВыбораСпособаПризнанияДоходов.Добавить(ПараметрВыбора);
	
	Возврат Новый ФиксированныйМассив(ПараметрыВыбораСпособаПризнанияДоходов);
	
КонецФункции

Функция ПараметрыВыбораСпособаПризнанияРасходов(ВидОперацииПринятияКУчетуПравПользованияОС) Экспорт
	
	ДопустимыеСпособыПризнанияРасходов = Новый Массив;
	ДопустимыеСпособыПризнанияРасходов.Добавить(Перечисления.СпособыПризнанияРасходов.ПоМесяцам);
	ДопустимыеСпособыПризнанияРасходов.Добавить(Перечисления.СпособыПризнанияРасходов.ПоКалендарнымДням);
	Если ВидОперацииПринятияКУчетуПравПользованияОС <>
			Перечисления.ВидыОперацийПринятияКУчетуПравПользованияОС.ПоступлениеВБезвозмездноеПользование Тогда
		// При безвозмездном пользовании не может быть графика платежей.
		ДопустимыеСпособыПризнанияРасходов.Добавить(Перечисления.СпособыПризнанияРасходов.ПоГрафику);
	КонецЕсли;
	ДопустимыеСпособыПризнанияРасходов.Добавить(Перечисления.СпособыПризнанияРасходов.ВОсобомПорядке);
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Ссылка",
		Новый ФиксированныйМассив(ДопустимыеСпособыПризнанияРасходов));
	ПараметрыВыбораСпособаПризнанияРасходов = Новый Массив();
	ПараметрыВыбораСпособаПризнанияРасходов.Добавить(ПараметрВыбора);
	
	Возврат Новый ФиксированныйМассив(ПараметрыВыбораСпособаПризнанияРасходов);
	
КонецФункции

#КонецОбласти

#КонецЕсли
